import platform
import time
import os
import psutil

print('感谢您的使用！在关机前，我们需要报告以下情况：')
time.sleep(1)
print('''                             操作系统信息
         ====================================================================
         -----------------------------Python版本------------------------------
                                         {}
         ------------------------操作系统可执行程序的结构-------------------------
                                  {}
         --------------------------------------------------------------------
         ----------------------------计算机的网络名称---------------------------
                                        {}
         --------------------------------------------------------------------
         --------------------------操作系统名称及版本号--------------------------
                                 {}
         --------------------------------------------------------------------
         ----------------------------计算机处理器信息---------------------------
                      {}
         --------------------------------------------------------------------
         -----------------------操作系统中Python的构建日期-----------------------
                            {}
         --------------------------------------------------------------------
         -------------------------系统中python解释器信息------------------------
                                  {}
         --------------------------------------------------------------------
         ----------------------------操作系统的版本-----------------------------
                                       {}
         '''.format(platform.python_version(),platform.architecture(),
         platform.node(),platform.platform(),platform.processor(),
         platform.python_build(),platform.python_compiler(),platform.version())
         )
time.sleep(1)
print('报告完毕！')
time.sleep(0.5)
print('正在关闭所有应用程序……')
all_process_id = psutil.pids()
print(all_process_id)
time.sleep(0.5)
os.system("dir /a /s /l /b")
print('已全部关闭，正在关机……')
time.sleep(2)
os.system("shutdown -p")
